source("R/01helper.R", encoding = "utf-8")
# 加载数据------

##患者地图


asthmadat <- read_excel("data/截止7月28的患者数据.xlsx")

asthmadat <- read_excel("data/首访已提交数据2023-08-08.xlsx") %>% 
  filter(问卷状态=='已审核')



region_dat <- read_excel('data/省份列表.xlsx')
by_region_dat <-  asthmadat %>% select(省) %>% group_by(省) %>% 
  summarise(Freq = n()) %>% 
  left_join(region_dat,by='省')

pts_address2 <- read_excel('data/pts_address2.xlsx')


map_dat <- left_join(pts_address2,by_region_dat,by=c('prov'='省'))


###患者数据

history_dat <- asthmadat %>% select(`儿童时期(≤14岁)是否诊断哮喘`,
                                    `您是否存在以下过敏原导致的过敏史`,
                                    `您在日常生活环境中是否会经常接触以下物质`)

spirometry_dat <- asthmadat %>% select(肺通气功能)
cod_dat <- asthmadat %>% select(哮喘首次发病的时间)
season_dat <- asthmadat %>% select(`哮喘症状(喘息、气促/呼吸不畅、胸闷、咳嗽)是否有季节性`)
RBC_dat <- asthmadat %>% select(血常规检查)
NO_dat <- asthmadat %>% select(`呼出气一氧化氮(必填。本次访视检查结果，或允许时间窗为本次访视时间±1周)`)
smoking_dat <- asthmadat %>% select(您目前的吸烟状况属于以下哪种)
treatment_dat <- asthmadat %>% select(`过去的12个月内，哮喘治疗的主要药物有哪些`)


comorbidity_dat <- asthmadat %>% select(您是否患有以下合并症) 


ae_dat <- asthmadat %>% select(`过去的12个月内，有多少次哮喘急性发作`,
                                `过去的12个月，因为急性发作导致额外门诊/急诊就诊次数`,
                                `过去的12个月，因为急性发作导致系统激素使用(包括口服与静脉滴注，每次需连续使用≥3天)`,
                                `过去的12个月，因为急性发作导致住院次数`,
                                `过去的12个月，因为急性发作导致入住ICU/气管插管次数`,
                                `哮喘急性发作后，通常以下哪种症状最难缓解(持续时间更长)`,
                               `总体上，哮喘急性发作存在以下哪些诱因`
)



control_dat <- asthmadat %>% select(`在过去4周内，在工作、学习或家中,有多少时候哮喘妨碍您进行日常活动`,
                                     `在过去4周内，您有多少次呼吸困难`,
                                     `在过去4周内，因为哮喘（喘息、咳嗽呼吸困难、胸闷或疼痛），您有多少次在夜间醒来或早上比平时早醒`,
                                     `在过去4周内，您有多少次使用急救药物治疗(如沙丁胺醇)`,
                                     `您如何评价过去4周内您的哮喘控制情况`
)

prescription_dat <- asthmadat %>% select(
  `过去的12个月内，哮喘治疗的主要药物有哪些`,	
  `过去的12个月内，使用吸入激素（ICS）【包括单纯ICS或ICS与长效β2受体激动剂的联合制剂（LCS/LABA）或ICS与LABA与M受体拮抗剂（LAMA）】的总体情况`,
  `过去的12个月内，使用ICS或ICS/LABA或ICS/LAMA/LABA情况`,
  `过去的12个月内，是否使用长效抗胆碱药物(如噻托溴铵、格隆溴铵、乌美溴铵)，含联合制剂`,	
  `过去的12个月内，使用SABA【短效β2受体激动剂，如沙丁胺醇】的总体情况`,
  `过去的12个月内，使用过哪种生物制剂`,`过去12个月内，哮喘总体的控制情况（基于患者主观评价）`
  
)

diagnosis_dat <- asthmadat %>% select(疾病诊断,严重程度评估)

demo_dat <- asthmadat %>% select(年龄,性别,民族,BMI,教育程度,省,住院号) %>% 
  mutate(年龄 = sub('岁','',年龄) %>% as.numeric(),
         BMI = as.numeric(BMI))


symptom_dat <- asthmadat %>% select(`哮喘发病初期，首发的症状`,
                                     `哮喘发病以来，有以下哪些症状`,
                                     `哮喘发病以来，主要的症状为`,
                                     `哮喘发病以来，咳嗽VAS评分得分`,
                                     `过去的12个月内，是否有鼻部相关症状(鼻塞 、鼻痒、流涕、打喷嚏等)`,
                                     `过去的12个月内，是否有咽喉部相关症状(咽痒、咽干、异物感、咽痛、声音嘶哑等)`,
                                     `过去的12个月内，是否有反流相关症状(烧心、反酸、嗳气等)`,
                                     
                                     
) %>% 
  mutate(`哮喘发病初期，首发的症状` = ifelse(`哮喘发病初期，首发的症状`=='不确定',NA,`哮喘发病初期，首发的症状`),
         `哮喘发病以来，主要的症状为` = ifelse(`哮喘发病以来，主要的症状为`=='不确定',NA,`哮喘发病以来，主要的症状为`),
         `哮喘发病以来，咳嗽VAS评分得分` = ifelse(`哮喘发病以来，咳嗽VAS评分得分`=='-',NA,`哮喘发病以来，咳嗽VAS评分得分`)) %>% 
  rlang::set_names('首发症状','哮喘发病以来，有以下哪些症状','主要症状','咳嗽VAS评分','鼻部相关症状','咽喉部相关症状','反流相关症状')

#正则------
spirometry_out <- apply(spirometry_dat,1,spirometry_f) %>%
  data.frame() %>% t() %>% data.frame() %>%
  rlang::set_names('FEV1预计值'	,'FEV1实测值'	,'FEV1预计百分比',
            'FVC预计值'	,'FVC实测值'	,'FVC预计百分比',
            'FEV1/FVC预计值'	,'FEV1/FVC实测值'	,'FEV1/FVC预计百分比',
            'MMEF预计值'	,'MMEF实测值'	,'MMEF预计百分比',
            'MEF75预计值'	,'MEF75实测值'	,'MEF75预计百分比',
            'MEF25预计值'	,'MEF25实测值'	,'MEF25预计百分比',
            'MEF25-75预计值'	,'MEF25-75实测值'	,'MEF25-75预计百分比',
            'MEF50预计值'	,'MEF50实测值'	,'MEF50预计百分比',
            'PEF预计值'	,'PEF实测值'	,'PEF预计百分比'
  ) %>% data.frame()

colnames(spirometry_out) <- 
  c('FEV1预计值'	,'FEV1实测值'	,'FEV1预计百分比',
    'FVC预计值'	,'FVC实测值'	,'FVC预计百分比',
    'FEV1/FVC预计值'	,'FEV1/FVC实测值'	,'FEV1/FVC预计百分比',
    'MMEF预计值'	,'MMEF实测值'	,'MMEF预计百分比',
    'MEF75预计值'	,'MEF75实测值'	,'MEF75预计百分比',
    'MEF25预计值'	,'MEF25实测值'	,'MEF25预计百分比',
    'MEF25-75预计值'	,'MEF25-75实测值'	,'MEF25-75预计百分比',
    'MEF50预计值'	,'MEF50实测值'	,'MEF50预计百分比',
    'PEF预计值'	,'PEF实测值'	,'PEF预计百分比')

#病程


cod_out <- apply(cod_dat,1,cod_f) %>% data.frame() %>% t() %>% data.frame() %>%
  mutate(X2 = as.numeric(X2)) %>% 
  rlang::set_names('首次发病时间'	,'病程(月)'	) %>% data.frame()


##季节性

season_out <- apply(season_dat,1,season_f) %>% data.frame() %>% t() %>% data.frame() %>%
  rlang::set_names('是否有季节性'	,'季节性'	) %>% data.frame()


## 

RBC_out <- apply(RBC_dat,1,rbc_f) %>% data.frame() %>% t() %>% data.frame() %>%
  rlang::set_names('嗜酸性粒细胞计数'	,'嗜酸性粒细胞百分比','中性粒细胞计数','中性粒细胞百分比','var5') %>% data.frame() %>% 
  select(-var5)


NO_out <- apply(NO_dat,1,NO_f) %>% data.frame() %>% t() %>% data.frame() %>%
  rlang::set_names('呼出气一氧化氮'	,'呼出气一氧化氮仪器') %>% data.frame() 


smoking_out <- apply(smoking_dat,1,smoking_f) %>% do.call(rbind.data.frame, .) %>% 
  rlang::set_names("吸烟状况",'吸香烟数量','吸香烟年数','吸香烟指数','戒烟年','戒烟月')



treatment_out <- apply(treatment_dat,1,treatment_f) %>% do.call(rbind.data.frame, .)

comorbidity_out <- apply(comorbidity_dat,1,comorbidity_f) %>% do.call(rbind.data.frame, .)

#asthmadat %>% select(`您患高血压多久了(发现血压高时至今的时长)`) %>% table() %>% data.frame()



workdat <- cbind(demo_dat,
                     cod_out,
                     spirometry_out,
                     smoking_out,
                     symptom_dat,
                     season_out,
                     RBC_out,
                     NO_out,
                     ae_dat,
                     control_dat,
                     prescription_dat,
                     diagnosis_dat,
                    comorbidity_dat,
                 history_dat)


rio::export(workdat,'data/workdat.xlsx')


workdat1 <- read_excel("data/workdat.xlsx") %>% 
  mutate(咳嗽  = str_detect(`哮喘发病以来，有以下哪些症状`,'[咳嗽]'),
         喘息  = str_detect(`哮喘发病以来，有以下哪些症状`,'[喘息]'),
         `气促/呼吸不畅`  = str_detect(`哮喘发病以来，有以下哪些症状`,'[气促/呼吸不畅]'),
         胸闷  = str_detect(`哮喘发病以来，有以下哪些症状`,'[胸闷]')
  ) %>% 
  mutate(#呼出气一氧化氮 = ifelse(呼出气一氧化氮=='FeNO130','130',呼出气一氧化氮),
         #呼出气一氧化氮 = ifelse(呼出气一氧化氮=='<5','5',呼出气一氧化氮),
         吸烟状况 = case_when(吸烟状况=='已戒水烟' |吸烟状况=='已戒香烟' ~ '已戒烟',
                          吸烟状况=='正在吸水烟' |吸烟状况=='正在吸香烟' ~ '正在吸烟',
                          TRUE ~ 吸烟状况),
         吸香烟指数 =  as.numeric(case_when((吸烟状况!='已戒水烟' & 吸烟状况!='正在吸水烟' & 吸香烟指数 !='null') ~ 吸香烟指数,
                                       TRUE ~ NA) ),
         吸烟指数 = case_when(吸香烟指数 <10 ~ '[0,10)',
                          吸香烟指数 >=10 & 吸香烟指数 <25 ~ '[10,25)',
                          吸香烟指数 >=25 & 吸香烟指数 <50 ~ '[25,50)',
                          吸香烟指数 >=50  ~ '[50,+∞)',
                          TRUE ~ NA
         ),
         是否有季节性 = ifelse(是否有季节性=='不适用(总病程<2年)' ,NA,是否有季节性),
         春 = str_detect(季节性,'[春]'),
         夏 = str_detect(季节性,'[夏]'),
         秋 = str_detect(季节性,'[秋]'),
         冬 = str_detect(季节性,'[冬]'),
         民族 = ifelse(民族!='汉族','少数民族',民族),
         哮喘急性发作次数 = ifelse(`过去的12个月内，有多少次哮喘急性发作`=='不适用',NA,
                           `过去的12个月内，有多少次哮喘急性发作`),
         哮喘急性导致就诊 = ifelse(`过去的12个月，因为急性发作导致额外门诊/急诊就诊次数`=='不适用',NA,
                           `过去的12个月，因为急性发作导致额外门诊/急诊就诊次数`),
         哮喘急性导致系统激素使用 = ifelse(`过去的12个月，因为急性发作导致系统激素使用(包括口服与静脉滴注，每次需连续使用≥3天)`=='不适用',NA,
                               `过去的12个月，因为急性发作导致系统激素使用(包括口服与静脉滴注，每次需连续使用≥3天)`),
         
         急性发作导致住院次数 = ifelse(`过去的12个月，因为急性发作导致住院次数`=='不适用',NA,
                             `过去的12个月，因为急性发作导致住院次数`),
         
         急性发作导致入住ICU = ifelse(`过去的12个月，因为急性发作导致入住ICU/气管插管次数`=='不适用',NA,
                              `过去的12个月，因为急性发作导致入住ICU/气管插管次数`),
         
         急性发作最难缓解症状 = ifelse(`哮喘急性发作后，通常以下哪种症状最难缓解(持续时间更长)`=='不适用',NA,
                             `哮喘急性发作后，通常以下哪种症状最难缓解(持续时间更长)`),
         年龄分层 = case_when(年龄<= 24 ~ ' (0,24]',
                          年龄>24 & 年龄<=34 ~ ' (24,34]',
                          年龄>34 & 年龄<=44 ~ ' (34,44]',
                          年龄>44 & 年龄<=54 ~ ' (44,54]',
                          年龄>54 & 年龄<=64 ~ ' (54,64]',
                          年龄>64  ~ ' (64,+∞]',
                          
         )
         
         
  ) %>% 
  
  mutate(过敏性鼻炎 = str_detect(您是否患有以下合并症,'过敏性鼻炎'),
         高血压 = str_detect(您是否患有以下合并症,'高血压'),
         慢性阻塞性肺疾病 = str_detect(您是否患有以下合并症,'慢性阻塞性肺疾病'),
         鼻窦炎 = str_detect(您是否患有以下合并症,'鼻窦炎'),
         荨麻疹 = str_detect(您是否患有以下合并症,'荨麻疹'),
         其他 = str_detect(您是否患有以下合并症,'其他'),
         湿疹 = str_detect(您是否患有以下合并症,'湿疹'),
         胃食管反流病 = str_detect(您是否患有以下合并症,'胃食管反流病'),
         鼻息肉 = str_detect(您是否患有以下合并症,'鼻息肉'),
         冠心病 = str_detect(您是否患有以下合并症,'冠心病'),
         糖尿病 = str_detect(您是否患有以下合并症,'糖尿病'),
         过敏性结膜炎 = str_detect(您是否患有以下合并症,'过敏性结膜炎'),
         `心、脑血管性疾病` = str_detect(您是否患有以下合并症,'心、脑血管性疾病'),
         甲状腺相关疾病 = str_detect(您是否患有以下合并症,'甲状腺相关疾病'),
         特应性皮炎 = str_detect(您是否患有以下合并症,'特应性皮炎'),
         支气管扩张 = str_detect(您是否患有以下合并症,'支气管扩张'),
         睡眠呼吸暂停综合征 = str_detect(您是否患有以下合并症,'睡眠呼吸暂停综合征'),
         骨质疏松症 = str_detect(您是否患有以下合并症,'骨质疏松症'),
         无其他合并症 = str_detect(您是否患有以下合并症,'无其他合并症')
         
         ) %>% 
  
  mutate(哮喘急性导致就诊1 = str_extract(哮喘急性导致就诊,'[0-9无]+'),
         哮喘急性导致就诊2 = ifelse(哮喘急性导致就诊1=='无',0,哮喘急性导致就诊1) %>% as.numeric(),
         哮喘急性导致就诊3 = ifelse(哮喘急性导致就诊2>=3,'>=3次',paste0(哮喘急性导致就诊2,'次')),
         
         哮喘急性导致系统激素使用1 = str_extract(哮喘急性导致系统激素使用,'[0-9无]+'),
         哮喘急性导致系统激素使用2 = ifelse(哮喘急性导致系统激素使用1=='无',0,哮喘急性导致系统激素使用1) %>% as.numeric(),
         哮喘急性导致系统激素使用3 = ifelse(哮喘急性导致系统激素使用2>=3,'>=3次',paste0(哮喘急性导致系统激素使用2,'次')),
         
         急性发作导致住院次数1 = str_extract(急性发作导致住院次数,'[0-9无]+'),
         急性发作导致住院次数2 = ifelse(急性发作导致住院次数1=='无',0,急性发作导致住院次数1) %>% as.numeric(),
         急性发作导致住院次数3 = ifelse(急性发作导致住院次数2>=3,'>=3次',paste0(急性发作导致住院次数2,'次')),
         
  ) %>% 
  mutate(
    未使用任何抗哮喘药物 = str_detect(`过去的12个月内，哮喘治疗的主要药物有哪些`,'未使用任何抗哮喘药物'),
    `吸入激素/长效β受体激动剂（ICS/LABA）` = str_detect(`过去的12个月内，哮喘治疗的主要药物有哪些`,'吸入激素/长效β受体激动剂（ICS/LABA）'),
    `苏黄、中药/中成药（汤剂/复方制剂等）` = str_detect(`过去的12个月内，哮喘治疗的主要药物有哪些`,'苏黄、中药/中成药（汤剂/复方制剂等）'),
    `白三烯受体拮抗剂(如孟鲁斯特)` = str_detect(`过去的12个月内，哮喘治疗的主要药物有哪些`,'白三烯受体拮抗剂\\(如孟鲁斯特\\)'),
    茶碱 = str_detect(`过去的12个月内，哮喘治疗的主要药物有哪些`,'茶碱'),
    `SABA（短效β2受体激动剂，如沙丁胺醇）` = str_detect(`过去的12个月内，哮喘治疗的主要药物有哪些`,'SABA（短效β2受体激动剂，如沙丁胺醇）'),
    其他 = str_detect(`过去的12个月内，哮喘治疗的主要药物有哪些`,'其他'),
    `吸入激素（ICS）` = str_detect(`过去的12个月内，哮喘治疗的主要药物有哪些`,'吸入激素（ICS）'),
    口服激素 = str_detect(`过去的12个月内，哮喘治疗的主要药物有哪些`,'口服激素'),
    `吸入激素/长效β受体激动剂/长效毒碱受体持抗剂(ICS/LABA/LAMA)` = str_detect(`过去的12个月内，哮喘治疗的主要药物有哪些`,
                                                           '吸入激素/长效β受体激动剂//长效毒碱受体持抗剂\\(ICS/LABA/LAMA\\)'),
    `吸入激素/长效B受体激动剂/长效抗胆碱药(ICS/LABA/LAMA)` = str_detect(`过去的12个月内，哮喘治疗的主要药物有哪些`,
                                                       '吸入激素/长效B受体激动剂/长效抗胆碱药\\(ICS/LABA/LAMA\\)'),
    生物制剂 = str_detect(`过去的12个月内，哮喘治疗的主要药物有哪些`,'生物制剂')
    
    
    ) %>% 
  mutate(`香烟烟雾（二手烟）` = str_detect(您在日常生活环境中是否会经常接触以下物质,
                                  "香烟烟雾\\（二手烟\\）"),
         `屋尘螨/粉尘螨` = str_detect(您在日常生活环境中是否会经常接触以下物质,
                                "屋尘螨/粉尘螨"),
         `污染空气（患者自评居住地空气质量差）` = str_detect(您在日常生活环境中是否会经常接触以下物质,
                                "污染空气\\（患者自评居住地空气质量差\\）"),
         `宠物饲养` = str_detect(您在日常生活环境中是否会经常接触以下物质,
                                "宠物饲养"),
         `牲畜饲养` = str_detect(您在日常生活环境中是否会经常接触以下物质,
                                "牲畜饲养"),
         `发霉物质（墙壁等）` = str_detect(您在日常生活环境中是否会经常接触以下物质,
                                "发霉物质\\（墙壁等\\）"),
         `煤炭` = str_detect(您在日常生活环境中是否会经常接触以下物质,
                                "煤炭"),
         `生物燃料烟雾` = str_detect(您在日常生活环境中是否会经常接触以下物质,
                                "生物燃料烟雾")
         
         ) %>% 
  mutate(`急性呼吸道感染(感冒、支气管炎等)` =  str_detect(`总体上，哮喘急性发作存在以下哪些诱因`,
                                            "急性呼吸道感染\\(感冒、支气管炎等\\)"),
         `天气变化` =  str_detect(`总体上，哮喘急性发作存在以下哪些诱因`,
                                            "天气变化"),
         `无明显诱因` =  str_detect(`总体上，哮喘急性发作存在以下哪些诱因`,
                                            "无明显诱因"),
         `空气污染(空气质量不好)` =  str_detect(`总体上，哮喘急性发作存在以下哪些诱因`,
                                            "空气污染\\(空气质量不好\\)"),
         `尘螨(屋尘螨、粉尘螨)` =  str_detect(`总体上，哮喘急性发作存在以下哪些诱因`,
                                            "尘螨\\(屋尘螨、粉尘螨\\)"),
         `蒿草、花粉、柳絮` =  str_detect(`总体上，哮喘急性发作存在以下哪些诱因`,
                                            "蒿草、花粉、柳絮"),
         `宠物毛发及皮屑` =  str_detect(`总体上，哮喘急性发作存在以下哪些诱因`,
                                            "宠物毛发及皮屑"),
         `停用治疗药物` =  str_detect(`总体上，哮喘急性发作存在以下哪些诱因`,
                                            "停用治疗药物"),
         `虾蟹等食物` =  str_detect(`总体上，哮喘急性发作存在以下哪些诱因`,
                                            "虾蟹等食物")
         ) %>% 
  mutate(
    就诊类型 = ifelse(住院号=="-",'门诊',"住院")
  ) %>% 
  left_join(region_dat,by=c('省'))


